relg101-f20/presentations/html/hesse-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Exploring Hesse's <i>Siddhartha</i></title>
<meta name="author" content="(Dale Hathaway)"/>
<link rel="stylesheet" href="../../reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="../../reveal.js/css/theme/beige.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<meta name="description" content="Org-Reveal">
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Exploring Hesse's <i>Siddhartha</i></h1><h2 class="author">Dale Hathaway</h2><h2 class="date">Feb. 17, 2020</h2><p class="date">Created: 2020-02-17 Mon 12:25</p>
</section>


<section>
<section id="slide-org86877aa">
<h2 id="org86877aa">Hesse (2)</h2>
</section>
<section id="slide-org2cb77a6">
<h3 id="org2cb77a6">first, religion <b>is not</b>:</h3>
<ul>
<li>necessarily monotheistic,</li>
<li>necessarily a body of moral rules</li>
<li>necessarily a belief in the supernatural, heaven, hell, or even life
after death</li>
<li>necessarily an explanation of the origins of creation.</li>

</ul>


</section>
<section id="slide-org7a53cfb">
<h3 id="org7a53cfb">Religion <b>is</b>:</h3>
<ul>
<li>notion of sacred reality</li>
<li>orders and brings understanding to human existence</li>
<li>has lasting effect on thinking, feeling, acting</li>

</ul>

</section>
</section>
<section>
<section id="slide-org2025db7">
<h2 id="org2025db7">Outline of Siddhartha</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">Siddhartha</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">Chapters</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">The Son of the Brahmin</td>
<td class="org-right">4</td>
<td class="org-left">Sansara</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Among the Samanas</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">Beside the River</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Gautama</td>
<td class="org-right">5</td>
<td class="org-left">The Ferryman</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Awakening</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">The Son</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Kamala</td>
<td class="org-right">6</td>
<td class="org-left">Om</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Among the Child People</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">Govinda</td>
</tr>
</tbody>
</table>


</section>
<section id="slide-org17fcb27">
<h3 id="org17fcb27">Directions</h3>
<p>
In each group do the following:
</p>

<ol>
<li>Choose 1 person to keep notes</li>
<li>Discuss the 2 sections among yourselves &#x2013; with the goal of being able to give the class a summary of that section of the book</li>
<li>Choose 1 or 2 people who will draw a picture on the board to illustrate the plot and your discussion</li>

</ol>
</section>
</section>
<section>
<section id="slide-org2348425">
<h2 id="org2348425">6 Themes of Siddhartha</h2>
<ol>
<li>Self-realization</li>
<li>Personal experience vs. Formal training</li>
<li>Persistence</li>
<li>Folly of materialism or less is more</li>
<li>paradox of unreal reality (reality is an illusion)</li>
<li>knowledge v. wisdom</li>

</ol>


</section>
<section id="slide-orgd7a91ce">
<h3 id="orgd7a91ce">With your group discuss:</h3>
<ol>
<li>most important illustration of the theme from the text</li>
<li>How important was that theme in the context of the whole work</li>
<li>What does the theme tell us about religion?</li>

</ol>


</section>
</section>
<section>
<section id="slide-org112a37e">
<h2 id="org112a37e">Exam 1</h2>
<ul>
<li>If you answered just about anything you would get credit for the question &#x2013; leading to a probably C</li>
<li>The vocabulary was to be found in the 2 books we read to date</li>
<li>The essays were marked on a scale of 1-3 (needs improvement, adequate, good job)</li>
<li>The grades from the 5 parts were averaged</li>

</ul>
</section>
</section>
</div>
</div>
<p> Created by Dale Hathaway. </p>
<script src="../../reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: '../../reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: '../../reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: '../../reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
